.tsung/newTag.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd" []>
<tsung loglevel="notice" version="1.0">
    <clients>
        <client host="localhost" use_controller_vm="true" maxusers="18000" />
    </clients>

    <servers>
        <server host="panda.eba-gaci4fx8.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
    </servers>

    <!-- <servers>
        <server host="localhost" port="3000" type="tcp"></server>
    </servers> -->
    <load>
        <arrivalphase phase="1" duration="30" unit="second"><users arrivalrate="1" unit="second"></users></arrivalphase>
        <arrivalphase phase="2" duration="30" unit="second"><users arrivalrate="2" unit="second"></users></arrivalphase>
        <arrivalphase phase="3" duration="30" unit="second"><users arrivalrate="4" unit="second"></users></arrivalphase>
    </load>

    <options>
        <option name="file_server" id="userlist" value="user.csv" />
    </options>

    <sessions>
        <session name="http-example" probability="100" type="ts_http">
            <transaction name="LOG_IN">
                <setdynvars sourcetype="file" fileid="userlist" delimiter="," order="iter">
                <var name="name" />
                <var name="password" />
                <var name="email" />
                <var name="points" />
                </setdynvars>
                <request>
                <dyn_variable name="authenticity_token" xpath="/html/head/meta[@name='csrf-token']/@content"></dyn_variable>
                <http url="/" method="GET" version="1.1"></http>
                </request>
                <!-- user click on login button to fill in form -->
                <request> <http url="/login" method="GET" version="1.1"></http> </request>
                <!-- user is filling login form -->
                <thinktime value="3" random="true"></thinktime>
                <request subst="true">
                <dyn_variable name="loginstatus" re="(.*)"/>
                <dyn_variable name="userid" re="Location: http://.*/users/(.*)\r" />
                <http
                    url="/login"
                    contents='authenticity_token=%%_authenticity_token%%&amp;session[email]=%%_email%%&amp;session[password]=test'
                    method="POST"
                    version="1.1">
                </http>
                </request>
            </transaction>

            <transaction name="CREATE_TAG">
                <!-- go to the make new tag page -->
                <request>
                    <http url="/tags/new" method="GET" version="1.1" />
                </request>

                <!-- user is writing a tag, it takes time -->
                <!-- <thinktime value="20" random="true"></thinktime> -->

                <!-- submitting the tag -->
                <setdynvars sourcetype="random_string" length="10">
                    <var name="name" />
                </setdynvars>
                <setdynvars sourcetype="random_string" length="30">
                    <var name="description" />
                </setdynvars>

                <request subst="true">
                    <dyn_variable name="postquest" re="(.*)" />
                    <!-- <match do="dump" when="nomatch">asldkf</match> -->
                    <http url="/tags"
                        contents='authenticity_token=%%_authenticity_token%%&amp;name=%%_name%%&amp;description=%%_description%%'
                        method="POST" version="1.1">
                    </http>
                </request>
            </transaction>

            <transaction name="VIEW_Profile">
                <request subst="true">
                    <http url="/users/%%_userid%%" method="GET" version="1.1" />
                </request>
            </transaction>

            <transaction name="VIEW_TAG">
                <request subst="true">
                    <http url="/" method="GET" version="1.1" />
                </request>
            </transaction>



            <!-- <setdynvars sourcetype="eval" code="fun( {Pid, DynVars} ) ->
      io:format([126, $p, 126, $n, 126, $n], [DynVars]),
      ok end.">
            </setdynvars> -->
        </session>
    </sessions>
</tsung>