.tsung/test2.xml
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd">

<tsung loglevel="notice" version="1.0">
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="1000"/>
  </clients>
  <servers>
    <server host="localhost" port="3000" type="tcp"/>
  </servers>
  <load>
    <arrivalphase phase="1" duration="10" unit="second">
      <users arrivalrate="2" unit="second"/>
    </arrivalphase>
    <!-- <arrivalphase phase="2" duration="30" unit="second">
      <users arrivalrate="32" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="3" duration="30" unit="second">
      <users arrivalrate="64" unit="second"/>
    </arrivalphase> -->
  </load>
  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="http-example" probability="100" type="ts_http">

    <!-- get home page -->

      <request>
        <dyn_variable name="authenticity_token" xpath="/html/head/meta[@name='csrf-token']/@content"></dyn_variable>
        <http url="/" method="GET" version="1.1"></http>
      </request>

    <!-- get sign up page -->

      <request>
        <http url="/users" method="GET" version="1.1" />
      </request>

    <!-- set variable -->
      <thinktime value="2" random="true"></thinktime>

      <setdynvars sourcetype="random_string" length="5">
        <var name="randusername"/>
      </setdynvars>

    <request>
      <http url="/users/new" method="GET" version="1.1"/>
    </request>

    <!-- post to sign up page -->
    <request subst="true">
      <dyn_variable name="signupstatus" re="(.*)" />
      <http url="/users" method="POST" version="1.1" contents="authenticity_token=%%_authenticity_token%%&amp;user[name]=%%_randusername%%&amp;user[email]=%%ts_user_server:get_unique_id%%user@hotmail.com&amp;user[password]=test&amp;user[points]=100" />
    </request>


    <request subst="true">
      <dyn_variable name="loginstatus" re="(.*)"/>
      <dyn_variable name="userid" re="Location: http://.*/users/(.*)\r" />
      <http
        url="/login"
        contents='authenticity_token=%%_authenticity_token%%&amp;session[email]=%%ts_user_server:get_unique_id%%user@hotmail.com&amp;session[password]=test'
        method="POST"
        version="1.1">
      </http>
    </request>

    <!-- <request subst="true">
      <dyn_variable name="deletestatus" re="(.*)"/>
      <http
        url="/users/%%_userid%%"
        method="DELETE"
        version="1.1">
      </http>
    </request> -->

    <setdynvars sourcetype="eval" code="fun( {Pid, DynVars} ) ->
      io:format([126, $p, 126, $n, 126, $n], [DynVars]),
      ok end.">
    </setdynvars>

    </session>
  </sessions>
</tsung>